/*
 ввод экземпляров класса из входного потока и вывод их значений в выходной поток;это << и >>
 вычисление значения функции в некоторой точке x0 (использовать метод кусочно-линейной интерполяции);это ()
 добавление нового узла в функцию. это +=
 И еще преобразование в bool (https://en.cppreference.com/w/cpp/language/cast_operator) - если есть хотя бы одна точка то true, если нет то false
*/
#include <iostream>
#include "lib.hpp"
#include "g_num.hpp"




int main()
{
    dialog();
    return 0;
}
